#+TITLE: Supported Languages in Scimax VS Code
#+AUTHOR: Scimax VS Code Team
#+DATE: 2026-01-17
#+STARTUP: overview
#+OPTIONS: toc:2 num:t H:4
#+TODO: ⚠️ 👀 | ✅

*Keybinding Note:* This extension uses Emacs-style keybindings where Ctrl is used on all platforms (not Cmd on Mac), except where explicitly noted. Mac alternatives are shown as Cmd where applicable.

** ✅ Choosing an Executor


# Native Python (direct python3 command)
#+BEGIN_SRC python
print("Hello from native Python")
#+END_SRC

#+RESULTS:
: Hello from native Python

# Jupyter Python (uses IPython kernel)
#+BEGIN_SRC jupyter-python
print("Hello from Jupyter Python")
#+END_SRC

#+RESULTS:
: Hello from Jupyter Python


** ✅ Basic Example (Native)

#+BEGIN_SRC python
# Native Python execution
import math

radius = 5
area = math.pi * radius ** 2

print(f"Circle area: {area:.2f}")
#+END_SRC

#+RESULTS:
: Circle area: 78.54

** ✅ Session Example (Jupyter)


#+BEGIN_SRC jupyter-python :session *py-session*
# First block - define variables
data = [1, 2, 3, 4, 5]
print(f"Data initialized: {data}")
#+END_SRC

#+RESULTS:
: Data initialized: [1, 2, 3, 4, 5]

#+BEGIN_SRC jupyter-python :session *py-session*
# Second block - uses variables from first block
import statistics
mean = statistics.mean(data)
print(f"Mean: {mean}")
#+END_SRC

#+RESULTS:
: Mean: 3.0

** ✅ Basic Example

#+BEGIN_SRC bash
# List files in current directory
ls -la | head -n 5
#+END_SRC

#+RESULTS:
: total 1728
: drwxr-xr-x@ 42 jkitchin  staff   1344 Jan 16 20:01 .
: drwxr-xr-x@ 53 jkitchin  staff   1696 Jan 16 19:58 ..
: drwxr-xr-x@  9 jkitchin  staff    288 Jan 15 15:46 .ob-jupyter
: -rw-r--r--@  1 jkitchin  staff  28933 Jan 16 20:04 00-index.org

** ✅ Basic Example

#+BEGIN_SRC javascript
// JavaScript execution
const numbers = [1, 2, 3, 4, 5, 6];
const sum = numbers.reduce((a, b) => a + b, 0);
console.log(`Sum: ${sum}`);
#+END_SRC

#+RESULTS:
: Sum: 21

** ✅ Working with JSON

#+BEGIN_SRC javascript
const data = {
  name: "Scimax",
  version: "1.0",
  features: ["org-mode", "jupyter", "references"]
};

console.log(JSON.stringify(data, null, 2));
#+END_SRC

#+RESULTS:
: {
:   "name": "Scimax",
:   "version": "1.0",
:   "features": [
:     "org-mode",
:     "jupyter",
:     "references"
:   ]
: }

